spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
#include <stdint.h>
#include <cstring>
#include <cmath>

#include "bsp.hpp"
#include "error.hpp"
#include "debug.hpp"
#include "gpio.hpp"
#include "scheduler.hpp"
#include "timer.hpp"
#include "binascii.hpp"
#include "smd_sat.hpp"
#include "pmu.hpp"
#include "bitpack.hpp"

#include "nrf_delay.h"
#include "nrf_gpio.h"

//TODO: warmup time not managed by firmware right now

#define ARRAY_SIZE(arr) (sizeof(arr) / sizeof((arr)[0]))
extern Scheduler *system_scheduler;
extern Timer *system_timer;

static constexpr const char *const spistatus_string[] =
{
    "SPI_INIT",    
    "SPI_IDLE",   
    "SPI_PROCESS_CMD", 
    "SPI_WAITING_RX",
    "SPI_WAITING_TX",
    "SPI_WAITING_MAC_EVT", 
    "SPI_ERROR"
};
static constexpr const char *const kmacstatus_string[] =
{
    "MAC_UNKNOWN",    
    "MAC_OK",   
    "MAC_TX_DONE", 
    "MAC_TX_SIZE_ERROR",
    "MAC_TXACK_DONE",
    "MAC_TX_TIMEOUT", 
    "MAC_TXACK_TIMEOUT",
    "MAC_RX_ERROR",
    "MAC_RX_TIMEOUT",
    "MAC_ERROR"
};

void SmdSat::read_byte(uint8_t *byte_read) {
	// Read byte is done after a send command, wait before to request read.
    nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
    uint8_t read_cmd = SMDSAT_CMD_NONE;
    int ret;

    ret = m_nrf_spim->transfer(&read_cmd, byte_read, sizeof(read_cmd));
    if (ret) {
       throw ErrorCode::SPI_COMMS_ERROR;
	}
	return;
}

void SmdSat::send_command(uint8_t command) {
    uint8_t buffer_read;
    int ret;
	DEBUG_TRACE("%s::Send %u",__func__, command);

    ret = m_nrf_spim->transfer(&command, &buffer_read, sizeof(command));
    if (ret) {
       throw ErrorCode::SPI_COMMS_ERROR;
	}
	return;
}

void SmdSat::send_command(const uint8_t *tx_data, uint8_t *rx_data, uint16_t size) {
    int ret = m_nrf_spim->transfer(tx_data, rx_data, size);
    if (ret) {
       throw ErrorCode::SPI_COMMS_ERROR;
	}
	return;
}

void SmdSat::load_kmac_profil(uint8_t profile)
{
	uint8_t tx[SMDSAT_CMD_WRITEKMAC_LEN] = {0};
	uint8_t rx[SMDSAT_CMD_WRITEKMAC_LEN] = {0};
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	send_command(SMDSAT_CMD_WRITE_KMAC_REQ);
	tx[0] = SMDSAT_CMD_WRITE_KMAC;
	tx[1] = profile;
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	send_command(tx, rx, SMDSAT_CMD_WRITEKMAC_LEN);
	return;
}

void SmdSat::get_spi_status(uint8_t *status) {
	send_command(SMDSAT_CMD_SPI_STATUS);
	read_byte(status);
	DEBUG_TRACE("SmdSat::spi status=%s", (char *)spistatus_string[*status]);
	return;
}

void SmdSat::get_kmac_status(uint8_t *status) {
	DEBUG_TRACE("SmdSat::kmac status=%s", (char *)kmacstatus_string[*status]);
	send_command(SMDSAT_CMD_MAC_STATUS);
	read_byte(status);
	return;
}
void SmdSat::set_radio_conf(uint8_array_t *radio_conf) {
	DEBUG_TRACE("%s",__func__);
	// - 1 size to remove cmd written
	if(radio_conf->size != SMDSAT_CMD_WRITECONF_LEN - 1){
		DEBUG_ERROR("%s::Size allocated to set radio conf %u != from %u",
			__func__, radio_conf->size, SMDSAT_CMD_WRITECONF_LEN - 1);
		return;
	}
	//spi_write(spiTxBuffer, 1);
	send_command(SMDSAT_CMD_WRITE_RCONF_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITECONF_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_RCONF;
	memcpy(&(tx[1]), radio_conf->p_data, radio_conf->size);
	send_command(tx, NULL, SMDSAT_CMD_WRITECONF_LEN);
	return;
}


void SmdSat::read_radio_conf(ArgosModulation *modulation){
	DEBUG_TRACE("%s",__func__);
	send_command(SMDSAT_CMD_READ_RCONF);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t rx[SMDSAT_CMD_READCONF_LEN] = {0};
	uint8_t tx[SMDSAT_CMD_READCONF_LEN] = {0};
	send_command(tx, rx, SMDSAT_CMD_READCONF_LEN);

    uint32_t min_frequency = (rx[3] << 24) |
                             (rx[2] << 16) |
                             (rx[1] << 8)  |
                              rx[0];

    uint32_t max_frequency = (rx[7] << 24) |
                             (rx[6] << 16) |
                             (rx[5] << 8)  |
                              rx[4];

    int8_t rf_level = rx[8];

    *modulation = static_cast<ArgosModulation>(rx[9]); 


    // Print the decoded values
    DEBUG_INFO("Modulation: %u, Min Frequency: %u, Max Frequency: %u, RF Level %u", *modulation,
		min_frequency, max_frequency, rf_level);
	return;
}

bool SmdSat::save_radio_conf(){
	DEBUG_TRACE("%s",__func__);
	send_command(SMDSAT_CMD_SAVE_RCONF);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t ack = 0;
	read_byte(&ack);
	if (ack == 1) {
		DEBUG_INFO("%s::radio conf saved",__func__);
		return true;
	} else {
		DEBUG_WARN("%s::radio conf failed to save",__func__);
		return false;
	}
}
void SmdSat::read_lpm(uint8_t *lpm_mode) {
	DEBUG_TRACE("%s",__func__);
	send_command(SMDSAT_CMD_READ_LPM);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	read_byte(lpm_mode);
	DEBUG_INFO("SMD LPM mode is: %u", *lpm_mode);
	return;
}

void SmdSat::write_lpm(uint8_t *lpm_mode){
	DEBUG_TRACE("%s",__func__);
	send_command(SMDSAT_CMD_WRITE_LPM_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_LPM_LEN], rx[SMDSAT_CMD_WRITE_LPM_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_LPM;
	tx[1] = *lpm_mode;
	send_command(tx, rx, SMDSAT_CMD_WRITE_LPM_LEN);
	DEBUG_INFO("SMD LPM mode is: %u", *lpm_mode);
	return;
}
void SmdSat::read_version(uint8_t *version){
	DEBUG_TRACE("%s",__func__);
	send_command(SMDSAT_CMD_READ_VERSION);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	read_byte(version);
	DEBUG_INFO("SMD SPI Version: %u", *version);
	return;
}

void SmdSat::read_address(uint8_array_t *address){
	DEBUG_TRACE("%s",__func__);
	if(address->size != SMDSAT_CMD_READ_ADDR_LEN){
		DEBUG_ERROR("%s::Size allocated to store address %u != from %u",
			__func__, address->size, SMDSAT_CMD_READ_ADDR_LEN);
		return;
	}
	send_command(SMDSAT_CMD_READ_ADDR);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);

	uint8_t tx[SMDSAT_CMD_READ_ADDR_LEN] = {0};
	send_command(tx, address->p_data, address->size);
	DEBUG_INFO("SMD Address: 0x%02X%02X%02X%02X",
               address->p_data[0],
               address->p_data[1],
               address->p_data[2],
               address->p_data[3]);
	return;
}


void SmdSat::set_address(uint8_array_t *address){
	DEBUG_TRACE("%s:: ",__func__);
	// - 1 size to remove cmd written
	if(address->size != SMDSAT_CMD_WRITE_ADDR_LEN-1){
		DEBUG_ERROR("%s::Size allocated to store address %u != from %u",
			__func__, address->size, SMDSAT_CMD_WRITE_ADDR_LEN-1);
		return;
	}
	send_command(SMDSAT_CMD_WRITE_ADDR_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_ADDR_LEN], rx[SMDSAT_CMD_WRITE_ADDR_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_ADDR;
	memcpy(&(tx[1]), address->p_data, address->size);

	send_command(tx, rx, (uint16_t)SMDSAT_CMD_WRITE_ADDR_LEN);
	
	// Create a buffer to build the output string.
    char buffer[128];
    int offset = 0;

    // Start the message
    offset += snprintf(buffer + offset, sizeof(buffer) - offset, "SMD Address write:");

	for (size_t i = 0; i < address->size; i++) {
        offset += snprintf(buffer + offset, sizeof(buffer) - offset, " 0x%02X", address->p_data[i]);
    } 
	DEBUG_INFO("%s", buffer);
	return;
}

	void SmdSat::read_seckey(uint8_array_t *seckey){
	DEBUG_TRACE("%s",__func__);
	if(seckey->size != SMDSAT_CMD_READ_SECKEY_LEN){
		DEBUG_ERROR("%s::Size allocated to store address %u != from %u",
			__func__, seckey->size, SMDSAT_CMD_READ_SECKEY_LEN);
		return;
	}
	send_command(SMDSAT_CMD_READ_SECKEY);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);

	uint8_t tx[SMDSAT_CMD_READ_SECKEY_LEN] = {0};
	send_command(tx, seckey->p_data, seckey->size);
	// Create a buffer to build the output string.
    char buffer[128];
    int offset = 0;

    // Start the message
    offset += snprintf(buffer + offset, sizeof(buffer) - offset, "SMD SecKey read:");

    // Loop through each of the 16 bytes and append them in hexadecimal format.
    for (size_t i = 0; i < seckey->size; i++) {
        offset += snprintf(buffer + offset, sizeof(buffer) - offset, " 0x%02X", seckey->p_data[i]);
    } 
	DEBUG_INFO("%s", buffer);
	return;
}


void SmdSat::set_seckey(uint8_array_t *seckey){
	DEBUG_TRACE("%s:: ",__func__);
	if(seckey->size != SMDSAT_CMD_WRITE_SECKEY_LEN - 1){
		DEBUG_ERROR("%s::Size allocated to store address %u != from %u",
			__func__, seckey->size, SMDSAT_CMD_WRITE_SECKEY_LEN);
		return;
	}
	send_command(SMDSAT_CMD_WRITE_SECKEY_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_SECKEY_LEN], rx[SMDSAT_CMD_WRITE_SECKEY_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_SECKEY;
	memcpy(&(tx[1]), seckey->p_data, seckey->size);
	send_command(tx, rx, SMDSAT_CMD_WRITE_SECKEY_LEN);
	
	// Create a buffer to build the output string.
    char buffer[128];
    int offset = 0;

    // Start the message
    offset += snprintf(buffer + offset, sizeof(buffer) - offset, "SMD SecKey write:");

	for (size_t i = 0; i < seckey->size; i++) {
        offset += snprintf(buffer + offset, sizeof(buffer) - offset, " 0x%02X", seckey->p_data[i]);
    } 
	DEBUG_INFO("%s", buffer);
	return;
}
void SmdSat::read_id(uint32_t *id){
	if (id == nullptr) 
	{
		DEBUG_ERROR("%s::id ptr is null",__func__);
		return;
	}
	send_command(SMDSAT_CMD_READ_ID);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_READ_ID_LEN] = {0};
	uint8_t rx[SMDSAT_CMD_READ_ID_LEN] = {0};
	send_command(tx, rx,SMDSAT_CMD_READ_ID_LEN);
	for (int i = 0; i < SMDSAT_CMD_READ_ID_LEN; i++) {
		*id |= rx[i] << (8 * i);
	 }
	DEBUG_INFO("%s::SMD ID: 0x%u", __func__, *id);
	return;
}
void SmdSat::set_id(uint32_t id){
	DEBUG_TRACE("%s:: id: %u",__func__, id);
	send_command(SMDSAT_CMD_WRITE_ID_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_ID_LEN], rx[SMDSAT_CMD_WRITE_ID_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_ID;
	memcpy(&(tx[1]), &id, sizeof(id));
	send_command(tx, rx, SMDSAT_CMD_WRITE_ID_LEN);
	return;
}

void SmdSat::read_tcxo_warmup(uint8_t *time_ms){
	if (time_ms == nullptr) 
	{
		DEBUG_ERROR("%s::tcxo ptr is null",__func__);
		return;
	}
	send_command(SMDSAT_CMD_READ_ID);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_READ_ID_LEN] = {0};
	uint8_t rx[SMDSAT_CMD_READ_ID_LEN] = {0};
	send_command(tx, rx,SMDSAT_CMD_READ_ID_LEN);
	for (int i = 0; i < SMDSAT_CMD_READ_ID_LEN; i++) {
		*time_ms |= rx[i] << (8 * i);
	 }
	DEBUG_INFO("%s::SMD TCXO wamrup time: %u", __func__, *time_ms);
	return;
}
void SmdSat::write_tcxo_warmup(uint32_t time_ms){
	DEBUG_TRACE("%s:: tcxo warmup time: %u",__func__, time_ms);
	send_command(SMDSAT_CMD_WRITE_TCXO_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_TCXO_LEN], rx[SMDSAT_CMD_WRITE_TCXO_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_TCXO;
	memcpy(&(tx[1]), &time_ms, sizeof(time_ms));
	send_command(tx, rx, SMDSAT_CMD_WRITE_ID_LEN);
	
	return;
}
void SmdSat::read_serial(uint8_array_t *serial){
	DEBUG_TRACE("%s",__func__);
	if(serial->size != SMDSAT_CMD_READ_SERIAL_LEN){
		DEBUG_ERROR("%s::Size allocated to store address %u != from %u",
			__func__, serial->size, SMDSAT_CMD_READ_SERIAL_LEN);
		return;
	}
	send_command(SMDSAT_CMD_READ_SN);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	
	uint8_t tx[SMDSAT_CMD_READ_SERIAL_LEN] = {0};
	send_command(tx, serial->p_data, serial->size);
	DEBUG_INFO("SMD SN: %.*s", serial->size, serial->p_data);
	return;
}
void SmdSat::set_tcxo_warmup(uint32_t time_s)
{
    DEBUG_TRACE("SmdSat::set_tcxo_warmup:TODO");
	this->write_tcxo_warmup(time_s*1000);
	return;
}

void SmdSat::set_tcxo_control(bool state) {
    DEBUG_TRACE("SmdSat::set_tcxo_control:Managed by SMD module");
}
void SmdSat::print_firmware_version() {
	send_command(SMDSAT_CMD_READ_FIRMWARE);
	uint8_t tx[SMDSAT_CMD_READ_FIRMWARE_LEN] = {0};
	uint8_t rx[SMDSAT_CMD_READ_FIRMWARE_LEN] = {0};
	send_command(tx, rx, (uint16_t)SMDSAT_CMD_READ_FIRMWARE_LEN);
    DEBUG_TRACE("SmdSat::print_firmware_version: %s", rx);
	return;
}


