spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
bool SmdSat::smd_ping()
{
    DEBUG_TRACE("SmdSat::%s",__func__);
	send_command(SMDSAT_CMD_PING);
	uint8_t ping = 0;
	read_byte(&ping);
	if (ping == 1) {
		DEBUG_INFO("SmdSat::Ping ACK from SMD received");
		return true;
	} else {
		DEBUG_INFO("SmdSat::Ping not received : received : %u", ping);
		return false; 
	}
}
bool SmdSat::is_tx_finished() {
    DEBUG_TRACE("SmdSat::is_tx_finished:");
    uint8_t kmac_status = 0;
	get_kmac_status(&kmac_status);
	if(kmac_status == MAC_TX_DONE)
	{
		return true;
	} else {
		return false;
	}	
}
bool SmdSat::is_tx_in_progress() {
    DEBUG_TRACE("SmdSat::is_tx_in_progress:TODO");
	
	return true;
}

bool SmdSat::is_command_accepted() {
    DEBUG_TRACE("SmdSat::is_command_accepted:TODO");
	
	return true;
}

bool SmdSat::is_firmware_ready() {
    DEBUG_TRACE("SmdSat::is_firmware_ready:TODO");
	
	return true;
}
void SmdSat::power_off() {
    DEBUG_TRACE("ArsgosSmd::power_off");

    // The state machine will safely transition to stopped as soon
    // as all pending activities have completed
    if (!SMD_STATE_EQUAL(stopped)) {
    	m_stopping = true;
    }
	return;
}
void SmdSat::power_on() {
    DEBUG_TRACE("SmdSat::power_on");

    // Device is already powered
    if (m_state != SmdSat::stopped) {
    	m_stopping = false;  // Clear any pending stopping flag
    	DEBUG_TRACE("SmdSat::power_on: not disabled: state=%u", (unsigned int)m_state);
    	return;
    }
	
    // Set top-level state variables
    m_state = SmdSatState::starting; // Force a reset when the task starts
    m_stopping = false;

    // This will run the state machine perpetually until a power_off is called
    DEBUG_TRACE("SmdSat::start state machine");
    state_machine();
	return;
}


void SmdSat::power_off_immediate()
{
    DEBUG_TRACE("SmdSat::power_off_immediate");

    // We force a power off by cancelling the state machine and
    // forcing a stopped state
    if (!SMD_STATE_EQUAL(stopped)) {
    	system_scheduler->cancel_task(m_task);
    	SMD_STATE_CHANGE(idle, stopped);
    }
	return;
}



SmdSat::SmdSat(unsigned int idle_shutdown_ms) {
	DEBUG_TRACE("SmdSat::Constructor");
	set_idle_timeout(idle_shutdown_ms);
    m_ack_buffer.clear();
    m_packet_buffer.clear();
	m_modulation = ARGOS_MOD_LDA2;
    m_nrf_spim = nullptr;
    m_state = SmdSatState::stopped;
    m_tcxo_warmup_time = DEFAULT_TCXO_WARMUP_TIME_SECONDS;
	this->shutdown();
	is_kmac_profil_loaded = false; 
	return;
}
SmdSat::~SmdSat() {
	power_off_immediate();
	return;
}
void SmdSat::shutdown(void) {
	GPIOPins::clear(SAT_RESET);
	GPIOPins::clear(SAT_PWR_EN);
	return;
}

void SmdSat::state_machine(bool use_scheduler) {
	// Assume no delay between state machine invocations
	m_next_delay = 0;

	switch (m_state) {
	case SmdSat::starting:
		SMD_STATE_CALL(starting);
		break;
	case SmdSat::powering_on:
		SMD_STATE_CALL(powering_on);
		break;
	case SmdSat::load_kmac:
		SMD_STATE_CALL(load_kmac);
		break;
	case SmdSat::idle_pending:
		SMD_STATE_CALL(idle_pending);
		break;
	case SmdSat::idle:
		SMD_STATE_CALL(idle);
		break;
	case SmdSat::transmit_pending:
		SMD_STATE_CALL(transmit_pending);
		break;
	case SmdSat::transmitting:
		SMD_STATE_CALL(transmitting);
		break;
	case SmdSat::error:
		SMD_STATE_CALL(error);
		break;
	case SmdSat::stopped:
		SMD_STATE_CALL(stopped);
	default:
		break;
	}

	if (use_scheduler && !SMD_STATE_EQUAL(stopped)) {
		// Invoke ourselves again if we are not stopped
		DEBUG_TRACE("SmdSat::state_machine: reschedule in %u ms", m_next_delay);
		system_scheduler->cancel_task(m_task);
		m_task = system_scheduler->post_task_prio([this]() {
			state_machine();
		}, "SmdReceiverStateMachine", Scheduler::DEFAULT_PRIORITY, m_next_delay);
	}
	return;
}


void SmdSat::state_starting_enter() {
	return;
}

void SmdSat::state_starting_exit() {
	return;
}
void SmdSat::state_starting() 
{
    m_is_first_tx = true;
	is_kmac_profil_loaded = false;
	m_nrf_spim = new NrfSPIM(SPI_SATELLITE);
	m_state_counter = 3;
	m_next_delay = 0;
	SMD_STATE_CHANGE(starting, powering_on);
	return;
}

void SmdSat::state_error_enter() {
	// Dump device status
	uint8_t status = 0;
	get_kmac_status(&status);
	notify(ArticEventDeviceError({}));

	SMD_STATE_CHANGE(error, stopped);
	return;
}

void SmdSat::state_error_exit() {
	return;
}

void SmdSat::state_error() {
	SMD_STATE_CHANGE(error, stopped);
	return;
}


void SmdSat::state_stopped_enter() {
	// Cleanup the SPIM instance
	delete m_nrf_spim;
    m_nrf_spim = nullptr; // Invalidate this pointer so if we call this function again it doesn't call delete on an invalid pointer

	
	// FIXME: should this be moved into the NrfSPIM driver?
	nrf_gpio_cfg_output(BSP::SPI_Inits[SPI_SATELLITE].config.ss_pin);
	nrf_gpio_pin_clear(BSP::SPI_Inits[SPI_SATELLITE].config.ss_pin);
    nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.mosi_pin, NRF_GPIO_PIN_PULLDOWN);
    nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.miso_pin, NRF_GPIO_PIN_PULLDOWN);
    nrf_gpio_cfg_input(BSP::SPI_Inits[SPI_SATELLITE].config.sck_pin, NRF_GPIO_PIN_PULLDOWN);

    // Power down the device
	this->shutdown();
	is_kmac_profil_loaded = false; 

	// Clear down any leftover flags
	//m_rx_pending = false;
	m_packet_buffer.clear();
	m_ack_buffer.clear();

	notify(ArticEventPowerOff({}));
	return;
}

void SmdSat::state_stopped_exit() {
	return;
}

void SmdSat::state_stopped() {
	return;
}

void SmdSat::state_powering_on_enter() {
	return;
}

void SmdSat::state_powering_on_exit() {
	m_next_delay = SMDSAT_DELAY_POWER_ON_MS;
	return;
}

void SmdSat::state_powering_on() {
    GPIOPins::set(SAT_PWR_EN);
    GPIOPins::set(SAT_RESET);
    SMD_STATE_CHANGE(powering_on, idle_pending);
	return;
}

void SmdSat::state_load_kmac_enter() {
	return;
}

void SmdSat::state_load_kmac_exit() {
	return;
}

void SmdSat::state_load_kmac() {
	uint8_t kmac_status = 0;
	get_kmac_status(&kmac_status);
	if (kmac_status == MAC_OK) {
		if (!is_kmac_profil_loaded) {
			load_kmac_profil(1);
			m_next_delay = SMDSAT_DELAY_LOAD_KMAC_MS;
			is_kmac_profil_loaded = true;
		} else {
			m_next_delay = SMDSAT_DELAY_CMD_MS;
			DEBUG_TRACE("SmdSat::%s: KMAC profil already loaded", __func__);
		}
		SMD_STATE_CHANGE(load_kmac, idle_pending);
	} else {
		// Check retries
		if (--m_state_counter == 0) {
			// Failed to go IDLE
			DEBUG_ERROR("SmdSat::%s: failed to enter load kmac state",__func__);
			SMD_STATE_CHANGE(load_kmac, error);
		} else {
			m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
		}
	}
	return;
}
//TODO check if we use LPM or just turn ON/OFF device WAKEUP PIN USED in this case no CMD
void SmdSat::state_idle_pending_enter() {
	m_next_delay = SMDSAT_DELAY_CMD_MS;
	m_state_counter = 10;
	return;
}

