spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
    // Convert address to a 4-byte array and pass it as uint8_array_t
    uint8_t address_data[4] = {
        static_cast<uint8_t>((address >> 24) & 0xFF),
        static_cast<uint8_t>((address >> 16) & 0xFF),
        static_cast<uint8_t>((address >> 8) & 0xFF),
        static_cast<uint8_t>(address & 0xFF)
    };
    uint8_array_t address_val = {SMDSAT_CMD_WRITE_ADDR_LEN-1, address_data};
    set_address(&address_val);

	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
    // Convert hex string to binary using Binascii::unhexlify() (returns std::string)
    std::string seckey_val = Binascii::unhexlify(seckey);
    uint8_array_t seckey_struct = {static_cast<uint16_t>(seckey_val.size()), 
                                   reinterpret_cast<uint8_t *>(seckey_val.data())};
    set_seckey(&seckey_struct);

	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
    // Convert radio config hex string to binary
    std::string radioconf_val = Binascii::unhexlify(radioconf);
    uint8_array_t radioconf_struct = {static_cast<uint16_t>(radioconf_val.size()), 
                                      reinterpret_cast<uint8_t *>(radioconf_val.data())};
    set_radio_conf(&radioconf_struct);	
	if(stop_spi)
	{
		delete m_nrf_spim;
		m_nrf_spim = nullptr; // Invalidate this pointer so if we call this function again it doesn't call delete on an invalid pointer
	}
	if (m_state == SmdSatState::stopped)
	{
		shutdown();
	}
}

// TODO: implement read of raw radio conf value
void SmdSat::read_credentials(unsigned int *dec_id, unsigned int *address, std::string *seckey, std::string *radioconf) {
	DEBUG_TRACE("read SMD module credentials");
	bool stop_spi = false;
	if (m_state == SmdSatState::stopped)
	{
		GPIOPins::set(SAT_PWR_EN);
		GPIOPins::set(SAT_RESET);
	}
	if (m_nrf_spim == nullptr)
	{
		m_nrf_spim = new NrfSPIM(SPI_SATELLITE);
		stop_spi = true;
	}
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);

	// Read the ID
	 if (dec_id) {
		uint32_t dec_id_val = 0;
        read_id(&dec_id_val);
		*dec_id = static_cast<unsigned int>(dec_id_val);

		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
    }

    // Read the Address
    if (address) {
        uint8_t address_data[SMDSAT_CMD_READ_ADDR_LEN] = {0};
        uint8_array_t address_value = {SMDSAT_CMD_READ_ADDR_LEN, address_data};
        read_address(&address_value);
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
		*address  = (address_value.p_data[0] << 24) |
					(address_value.p_data[1] << 16) |
					(address_value.p_data[2] << 8)  |
					(address_value.p_data[3]);
    }

    // Read the Security Key and Convert to Hex String
    if (seckey) {
        uint8_t seckey_data[SMDSAT_CMD_READ_SECKEY_LEN] = {0};
        uint8_array_t seckey_value = {SMDSAT_CMD_READ_SECKEY_LEN, seckey_data};
        read_seckey(&seckey_value);
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);

        // Convert binary seckey data to hex and assign it to *seckey
        *seckey = Binascii::hexlify(std::string(reinterpret_cast<char *>(seckey_data), SMDSAT_CMD_READ_SECKEY_LEN));
    }

    // Read the Radio Configuration and Convert to Hex String
	ArgosModulation modulation_dev;
	read_radio_conf(&modulation_dev);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);

	if(stop_spi)
	{
		delete m_nrf_spim;
		m_nrf_spim = nullptr; // Invalidate this pointer so if we call this function again it doesn't call delete on an invalid pointer
	}
	if (m_state == SmdSatState::stopped) {
		shutdown();
	}
}